In [1]:
# Pandas and numpy for data manipulation
import pandas as pd
import numpy as np

# No warnings about setting value on copy of slice
pd.options.mode.chained_assignment = None

# Display up to 60 columns of a dataframe
pd.set_option('display.max_columns', 60)

# Matplotlib visualization
import matplotlib.pyplot as plt
%matplotlib inline

# Set default font size
plt.rcParams['font.size'] = 24

# Internal ipython tool for setting figure size
from IPython.core.pylabtools import figsize

# Seaborn for visualization
import seaborn as sns
sns.set(font_scale = 2)

# Splitting data into training and testing
from sklearn.model_selection import train_test_split

In [2]:
# Read in data into a dataframe
data = pd.read_csv('data/full.csv')

# Display top of dataframe
data.head(20)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,WikiId,Name_wiki,Age_wiki,Hometown,Boarded,Destination,Lifeboat,Body,Class
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,691.0,"Braund, Mr. Owen Harris",22.0,"Bridgerule, Devon, England",Southampton,"Qu'Appelle Valley, Saskatchewan, Canada",NaN,NaN,3.0
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,90.0,"Cumings, Mrs. Florence Briggs (née Thayer)",35.0,"New York, New York, US",Cherbourg,"New York, New York, US",4,NaN,1.0
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,865.0,"Heikkinen, Miss Laina",26.0,"Jyväskylä, Finland",Southampton,New York City,14?,NaN,3.0
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,127.0,"Futrelle, Mrs. Lily May (née Peel)",35.0,"Scituate, Massachusetts, US",Southampton,"Scituate, Massachusetts, US",D,NaN,1.0
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,627.0,"Allen, Mr. William Henry",35.0,"Birmingham, West Midlands, England",Southampton,New York City,NaN,NaN,3.0
5,6,0.0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,785.0,"Doherty, Mr. William John (aka ""James Moran"")",22.0,"Cork, Ireland",Queenstown,New York City,NaN,NaN,3.0
6,7,0.0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,200.0,"McCarthy, Mr. Timothy J.",54.0,"Dorchester, Massachusetts, US",Southampton,"Dorchester, Massachusetts, US",NaN,175MB,1.0
7,8,0.0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S,1108.0,"Pålsson, Master Gösta Leonard",2.0,"Bjuv, Skåne, Sweden",Southampton,"Chicago, Illinois, US",NaN,NaN,3.0
8,9,1.0,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S,902.0,"Johnson, Mrs. Elisabeth Vilhelmina (née Berg)",26.0,"St. Charles, Illinois, US",Southampton,"St. Charles, Illinois, US",15,NaN,3.0
9,10,1.0,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C,520.0,"Nassr Allah, Mrs. Adal (née Akim)[62][77]",14.0,"Zahlé, Lebanon, Ottoman Empire",Cherbourg,"Cleveland, Ohio, US",?,NaN,2.0
10,11,1.0,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S,1193.0,"Sandström, Miss Marguerite Rut",4.0,"Motala, Östergötland, Sweden",Southampton,"San Francisco, US",13,NaN,3.0
11,12,1.0,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S,35.0,"Bonnell, Miss Elizabeth",61.0,"Youngstown, Ohio, US",Southampton,"Youngstown, Ohio, US",8,NaN,1.0
12,13,0.0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S,1196.0,"Saundercock, Mr. William Henry",19.0,"St Austell, Cornwall, England",Southampton,New York City,NaN,NaN,3.0
13,14,0.0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S,632.0,"Andersson, Mr. Anders Johan",39.0,"Kisa, Östergötland, Sweden",Southampton,"Winnipeg, Manitoba, Canada",NaN,NaN,3.0
14,15,0.0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S,1286.0,"Veström, Miss Hulda Amanda Adolfina",14.0,"Salmunds, Gotland, Sweden",Southampton,"Los Angeles, US",NaN,NaN,3.0
15,16,1.0,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S,446.0,"Hewlett, Mrs. Mary Dunbar (née Kingcome)",56.0,"Lucknow, British India, UK[note 3]",Southampton,"Rapid City, South Dakota, US",13,NaN,2.0
16,17,0.0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q,1151.0,"Rice, Master Eugene Francis",2.0,"Athlone, Westmeath, Ireland",Queenstown,"Spokane, Washington, US",NaN,NaN,3.0
17,18,1.0,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S,604.0,"Williams, Mr. Charles Eugene",23.0,"Harrow, London, England",Southampton,"Chicago, Illinois, US",14,NaN,2.0
18,19,0.0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S,1280.0,"Vanderplancke, Mrs. Emelie Maria (née Vandemoo...",31.0,"Pittem, Belgium",Southampton,"Fremont, Ohio, US",NaN,NaN,3.0
19,20,1.0,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C,1053.0,"Muslamani, Mrs. Fatimah",22.0,"Tebnine, Lebanon",Cherbourg,"Michigan City, Indiana, US",C,NaN,3.0

In [3]:
# See the column data types and non-missing values
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 21 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1309 non-null   int64
 1   Survived     891 non-null    float64
 2   Pclass       1309 non-null   int64
 3   Name         1309 non-null   object
 4   Sex          1309 non-null   object
 5   Age          1046 non-null   float64
 6   SibSp        1309 non-null   int64
 7   Parch        1309 non-null   int64
 8   Ticket       1309 non-null   object
 9   Fare         1308 non-null   float64
 10  Cabin        295 non-null    object
 11  Embarked     1307 non-null   object
 12  WikiId       1304 non-null   float64
 13  Name_wiki    1304 non-null   object
 14  Age_wiki     1302 non-null   float64
 15  Hometown     1304 non-null   object
 16  Boarded      1304 non-null   object
 17  Destination  1304 non-null   object
 18  Lifeboat     502 non-null    object
 19  Body         130 non-null    object
 20  Class        1304 non-null   float64
dtypes: float64(6), int64(4), object(11)
memory usage: 214.9+ KB

In [4]:
data = data.drop(['Age', 'Name', 'Name_wiki', 'Body', 'Lifeboat', 'Cabin', 'Ticket', 'Embarked', 'WikiId', 'Class'], axis='columns')

In [5]:
data.head()

,PassengerId,Survived,Pclass,Sex,SibSp,Parch,Fare,Age_wiki,Hometown,Boarded,Destination
0,1,0.0,3,male,1,0,7.2500,22.0,"Bridgerule, Devon, England",Southampton,"Qu'Appelle Valley, Saskatchewan, Canada"
1,2,1.0,1,female,1,0,71.2833,35.0,"New York, New York, US",Cherbourg,"New York, New York, US"
2,3,1.0,3,female,0,0,7.9250,26.0,"Jyväskylä, Finland",Southampton,New York City
3,4,1.0,1,female,1,0,53.1000,35.0,"Scituate, Massachusetts, US",Southampton,"Scituate, Massachusetts, US"
4,5,0.0,3,male,0,0,8.0500,35.0,"Birmingham, West Midlands, England",Southampton,New York City

In [8]:
data_df = data.rename(columns={"Pclass":"Passenger Class", "SibSp":"Siblings", "Parch":"Parent/Child", "Age_wiki":"Age"})
data_df.head()

,PassengerId,Survived,Passenger Class,Sex,Siblings,Parent/Child,Fare,Age,Hometown,Boarded,Destination
0,1,0.0,3,male,1,0,7.2500,22.0,"Bridgerule, Devon, England",Southampton,"Qu'Appelle Valley, Saskatchewan, Canada"
1,2,1.0,1,female,1,0,71.2833,35.0,"New York, New York, US",Cherbourg,"New York, New York, US"
2,3,1.0,3,female,0,0,7.9250,26.0,"Jyväskylä, Finland",Southampton,New York City
3,4,1.0,1,female,1,0,53.1000,35.0,"Scituate, Massachusetts, US",Southampton,"Scituate, Massachusetts, US"
4,5,0.0,3,male,0,0,8.0500,35.0,"Birmingham, West Midlands, England",Southampton,New York City

In [9]:
data_df.to_csv(r'full_clean.csv', index = False)

In [ ]:
# Function to calculate missing values by column
def missing_values_table(df):
        # Total missing values
        mis_val = df.isnull().sum()
        
        # Percentage of missing values
        mis_val_percent = 100 * df.isnull().sum() / len(df)
        
        # Make a table with the results
        mis_val_table = pd.concat([mis_val, mis_val_percent], axis=1)
        
        # Rename the columns
        mis_val_table_ren_columns = mis_val_table.rename(
        columns = {0 : 'Missing Values', 1 : '% of Total Values'})
        
        # Sort the table by percentage of missing descending
        mis_val_table_ren_columns = mis_val_table_ren_columns[
            mis_val_table_ren_columns.iloc[:,1] != 0].sort_values(
        '% of Total Values', ascending=False).round(1)
        
        # Print some summary information
        print ("Your selected dataframe has " + str(df.shape[1]) + " columns.\n"      
            "There are " + str(mis_val_table_ren_columns.shape[0]) +
              " columns that have missing values.")
        
        # Return the dataframe with missing information
        return mis_val_table_ren_columns

In [ ]:
missing_values_table(data)

In [ ]:
# Histogram Plot of survivors
figsize(8, 8)
plt.hist(data['Passenger Class'].dropna(), bins = 20, edgecolor = 'black');
plt.xlabel('Class'); 
plt.ylabel('Count'); plt.title('Class Distribution');

In [15]:
survivor_only = data_df.loc[data_df['Survived'] == 1.0]
survivor_only.head()

,PassengerId,Survived,Passenger Class,Sex,Siblings,Parent/Child,Fare,Age,Hometown,Boarded,Destination
1,2,1.0,1,female,1,0,71.2833,35.0,"New York, New York, US",Cherbourg,"New York, New York, US"
2,3,1.0,3,female,0,0,7.9250,26.0,"Jyväskylä, Finland",Southampton,New York City
3,4,1.0,1,female,1,0,53.1000,35.0,"Scituate, Massachusetts, US",Southampton,"Scituate, Massachusetts, US"
8,9,1.0,3,female,0,2,11.1333,26.0,"St. Charles, Illinois, US",Southampton,"St. Charles, Illinois, US"
9,10,1.0,2,female,1,0,30.0708,14.0,"Zahlé, Lebanon, Ottoman Empire",Cherbourg,"Cleveland, Ohio, US"

In [13]:
dead_only = data_df.loc[data_df['Survived'] == 0.0]
dead_only.head()

PassengerId        549
Survived           549
Passenger Class    549
Sex                549
Siblings           549
Parent/Child       549
Fare               549
Age                546
Hometown           548
Boarded            548
Destination        548
dtype: int64

In [16]:
survivor_only.to_csv(r'survivor.csv', index = False)
dead_only.to_csv(r'dead.csv', index = False)

In [18]:
# Read in data into a dataframe
test_data = pd.read_csv('data/train.csv')

# Display top of dataframe
test_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,WikiId,Name_wiki,Age_wiki,Hometown,Boarded,Destination,Lifeboat,Body,Class
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,691.0,"Braund, Mr. Owen Harris",22.0,"Bridgerule, Devon, England",Southampton,"Qu'Appelle Valley, Saskatchewan, Canada",NaN,NaN,3.0
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,90.0,"Cumings, Mrs. Florence Briggs (née Thayer)",35.0,"New York, New York, US",Cherbourg,"New York, New York, US",4,NaN,1.0
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,865.0,"Heikkinen, Miss Laina",26.0,"Jyväskylä, Finland",Southampton,New York City,14?,NaN,3.0
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,127.0,"Futrelle, Mrs. Lily May (née Peel)",35.0,"Scituate, Massachusetts, US",Southampton,"Scituate, Massachusetts, US",D,NaN,1.0
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,627.0,"Allen, Mr. William Henry",35.0,"Birmingham, West Midlands, England",Southampton,New York City,NaN,NaN,3.0

In [19]:
test_df = test_data.drop(['Age', 'Name', 'Name_wiki', 'Body', 'Lifeboat', 'Cabin', 'Ticket', 'Embarked', 'WikiId', 'Class'], axis='columns')

In [20]:
test_df.head()

,PassengerId,Survived,Pclass,Sex,SibSp,Parch,Fare,Age_wiki,Hometown,Boarded,Destination
0,1,0.0,3,male,1,0,7.2500,22.0,"Bridgerule, Devon, England",Southampton,"Qu'Appelle Valley, Saskatchewan, Canada"
1,2,1.0,1,female,1,0,71.2833,35.0,"New York, New York, US",Cherbourg,"New York, New York, US"
2,3,1.0,3,female,0,0,7.9250,26.0,"Jyväskylä, Finland",Southampton,New York City
3,4,1.0,1,female,1,0,53.1000,35.0,"Scituate, Massachusetts, US",Southampton,"Scituate, Massachusetts, US"
4,5,0.0,3,male,0,0,8.0500,35.0,"Birmingham, West Midlands, England",Southampton,New York City

In [21]:
test_df = test_df.rename(columns={"Pclass":"Passenger Class", "SibSp":"Siblings", "Parch":"Parent/Child", "Age_wiki":"Age"})
test_df.head()

,PassengerId,Survived,Passenger Class,Sex,Siblings,Parent/Child,Fare,Age,Hometown,Boarded,Destination
0,1,0.0,3,male,1,0,7.2500,22.0,"Bridgerule, Devon, England",Southampton,"Qu'Appelle Valley, Saskatchewan, Canada"
1,2,1.0,1,female,1,0,71.2833,35.0,"New York, New York, US",Cherbourg,"New York, New York, US"
2,3,1.0,3,female,0,0,7.9250,26.0,"Jyväskylä, Finland",Southampton,New York City
3,4,1.0,1,female,1,0,53.1000,35.0,"Scituate, Massachusetts, US",Southampton,"Scituate, Massachusetts, US"
4,5,0.0,3,male,0,0,8.0500,35.0,"Birmingham, West Midlands, England",Southampton,New York City

In [22]:
test_df.to_csv(r'clean_train.csv', index = False)

In [25]:
train_data = pd.read_csv('data/clean_train.csv')

In [28]:
test = pd.read_csv('data/test.csv')
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,WikiId,Name_wiki,Age_wiki,Hometown,Boarded,Destination,Lifeboat,Body,Class
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,928.0,"Kelly, Mr. James",19.0,"Unknown, Ireland",Southampton,New York City,NaN,70MB,3.0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,1297.0,"Wilkes, Mrs. Ellen",47.0,"Penzance, Cornwall, England",Southampton,"Akron, Ohio, US",16,NaN,3.0
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,518.0,"Myles, Mr. Thomas Francis",63.0,"Fermoy, Ireland[note 1]",Queenstown,"Waban, Massachusetts, US",NaN,NaN,2.0
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,1303.0,"Wirz, Mr. Albert",27.0,"Uster, Switzerland",Southampton,"Beloit, Wisconsin, US",NaN,131MB,3.0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,871.0,"Hirvonen, Mrs. Helga Elisabeth (née Lindqvist)",22.0,"Taalintehdas, Finland",Southampton,"Monessen, Pennsylvania, US",15,NaN,3.0

In [29]:
test_data = test.drop(['Age', 'Name', 'Name_wiki', 'Body', 'Lifeboat', 'Cabin', 'Ticket', 'Embarked', 'WikiId', 'Class'], axis='columns')

In [30]:
test_data = test_data.rename(columns={"Pclass":"Passenger Class", "SibSp":"Siblings", "Parch":"Parent/Child", "Age_wiki":"Age"})
test_data.head()

,PassengerId,Passenger Class,Sex,Siblings,Parent/Child,Fare,Age,Hometown,Boarded,Destination
0,892,3,male,0,0,7.8292,19.0,"Unknown, Ireland",Southampton,New York City
1,893,3,female,1,0,7.0000,47.0,"Penzance, Cornwall, England",Southampton,"Akron, Ohio, US"
2,894,2,male,0,0,9.6875,63.0,"Fermoy, Ireland[note 1]",Queenstown,"Waban, Massachusetts, US"
3,895,3,male,0,0,8.6625,27.0,"Uster, Switzerland",Southampton,"Beloit, Wisconsin, US"
4,896,3,female,1,1,12.2875,22.0,"Taalintehdas, Finland",Southampton,"Monessen, Pennsylvania, US"

In [31]:
test_data.to_csv(r'clean_test.csv', index = False)